Revit 2027 API
WallFoundation.WallId Property
 Returns the id of the host wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId WallId { get; }
Public ReadOnly Property WallId As ElementId
	Get
public:
property ElementId^ WallId {
	ElementId^ get ();
}
member WallId : ElementId with get
Property Value
ElementId
See Also
Reference
WallFoundation Class
Autodesk.Revit.DB Namespace